INSERT INTO Building (node_id, name, alias, category, address, phone_number) VALUES
('585935651', '충남대학교 법학전문대학원 (N12)', 'w', '법학전문대학원', '대전광역시 유성구 대학로 99', '042-821-5814'),
('595282178', '충남대학교 학생생활관 9동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('595282179', '충남대학교 학생생활관 10동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('595282180', '충남대학교 학생생활관 7동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('595282182', '충남대학교 학생생활관 11동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('595309475', '충남대학교 제3학생회관 (N7)', 'w', '학생회관', '대전광역시 유성구 대학로 99', '042-821-5050'),
('595714131', '충남대학교 골프학습장 (N4)', 'w', '체육시설', '대전광역시 유성구 대학로 99', NULL),
('595714135', '충남대학교 정보통신원 (N2)', 'w', '정보통신원', '대전광역시 유성구 대학로 99', '042-821-8282'),
('595714139', '충남대학교 예술대학 미술관 (N9-1)', 'w', '예술대학', '대전광역시 유성구 대학로 99', NULL),
('595714144', '충남대학교 예술대학 디자인관 (N9-2)', 'w', '예술대학', '대전광역시 유성구 대학로 99', NULL),
('595714147', '충남대학교 실내체육관 (N15)', 'w', '체육시설', '대전광역시 유성구 대학로 99', NULL),
('595714151', '충남대학교 예술대학 음악1호관 (N10-1)', 'w', '예술대학', '대전광역시 유성구 대학로 99', NULL),
('595714155', '충남대학교 예술대학 음악2호관 (N10-2)', 'w', '예술대학', '대전광역시 유성구 대학로 99', NULL),
('595721368', '충남대학교 농업생명과학대학 1호관 (E10-1)', 'w', '농업생명과학대학', '대전광역시 유성구 대학로 99', NULL),
('595721373', '충남대학교 상록회관 (E9)', 'w', '기타', '대전광역시 유성구 대학로 99', NULL),
('653525326', '자연과학대학 1호관', 'w', '자연과학대학', '대전광역시 유성구 대학로 99', '042-821-5412'),
('653525584', '자연과학대학 2호관', 'w', '자연과학대학', '대전광역시 유성구 대학로 99', '042-821-5412'),
('663363274', '한빛나래관', 'w', '기타', '대전광역시 유성구 대학로 99', NULL),
('663363275', '다목적강당', 'w', '기타', '대전광역시 유성구 대학로 99', NULL),
('664846495', '약학대학', 'w', '약학대학', '대전광역시 유성구 대학로 99', NULL),
('745522188', '충남대학교 정보화본부', 'w', '정보화본부', '대전광역시 유성구 대학로 99', '042-821-8282'),
('745522190', '농업생명공학관', 'w', '농업생명공학관', '대전광역시 유성구 대학로 99', NULL),
('745522191', '농대', 'w', '농업생명과학대학', '대전광역시 유성구 대학로 99', NULL),
('745522215', '로켓추진 및 연소실험실', 'w', '연구시설', '대전광역시 유성구 대학로 99', NULL),
('745522218', 'N13-1 수의과대학', 'w', '수의과대학', '대전광역시 유성구 대학로 99', NULL),
('745522219', 'N13-2 충남대학교 동물병원', 'w', '동물병원', '대전광역시 유성구 대학로 99', NULL),
('745522225', '학생생활관12동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('745522226', '학생생활관13동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('819518089', '공동실험실습관', 'w', '실험실습관', '대전광역시 유성구 대학로 99', NULL),
('819519085', '글로벌인재양성센터', 'w', '교육센터', '대전광역시 유성구 대학로 99', NULL),
('819519086', '충남대학교 사범대학', 'w', '사범대학', '대전광역시 유성구 대학로 99', NULL),
('1283477626', '정심화국제문화회관', 'w', '문화회관', '대전광역시 유성구 대학로 99', NULL),
('1283477636', '융합교육혁신센터', 'w', '교육센터', '대전광역시 유성구 대학로 99', '042-821-5281'),
('1283477639', '산학연교육연구관', 'w', '연구관', '대전광역시 유성구 대학로 99', '042-821-8642'),
('1311908638', '충남대학교 도서관 별관', 'w', '도서관', '대전광역시 유성구 대학로 99', '042-821-6015'),
('1370208', '공과대학 1호관', 'w', '공과대학', '대전광역시 유성구 대학로 99', '042-821-5614'),
('17982068', '공과대학 2호관', 'w', '공과대학', '대전광역시 유성구 대학로 99', '042-821-5614'),
('1311700029', 'CNU 파빌리온', 'w', '기타', '대전광역시 유성구 대학로 99', NULL),
('1311702979', '충남대학교 어린이집', 'w', '어린이집', '대전광역시 유성구 대학로 99', NULL),
('1283477629', 'TIPS타운', 'w', '창업지원시설', '대전광역시 유성구 대학로 99', NULL),
('1283477630', '공과대학 4호관', 'w', '공과대학', '대전광역시 유성구 대학로 99', '042-821-5614'),
('94501295', '경상대학', 'w', '경상대학', '대전광역시 유성구 대학로 99', '042-821-5512'),
('461918242', '공과대학 5호관', 'w', '공과대학', '대전광역시 유성구 대학로 99', '042-821-5614'),
('461918243', '충남대학교 중앙도서관 (N1)', 'w', '도서관', '대전광역시 유성구 대학로 99', '042-821-6015'),
('461918244', '충남대학교 박물관 (N8)', 'w', '박물관', '대전광역시 유성구 대학로 99', '042-821-6041'),
('461918245', '인문대학', 'w', '인문대학', '대전광역시 유성구 대학로 99', '042-821-5314'),
('461918246', '제1학생회관', 'w', '학생회관', '대전광역시 유성구 대학로 99', '042-821-5050'),
('461918247', '한누리회관', 'w', '기타', '대전광역시 유성구 대학로 99', NULL),
('461918248', '노천극장', 'w', '기타', '대전광역시 유성구 대학로 99', NULL),
('468619599', '공과대학 3호관', 'w', '공과대학', '대전광역시 유성구 대학로 99', '042-821-5614'),
('468620537', '제2학생회관', 'w', '학생회관', '대전광역시 유성구 대학로 99', '042-821-5050'),
('469059480', '자연과학대학 기초1호관', 'w', '자연과학대학', '대전광역시 유성구 대학로 99', '042-821-5414'),
('469075270', '자연과학대학 기초2호관', 'w', '자연과학대학', '대전광역시 유성구 대학로 99', '042-821-5414'),
('469076970', '백마교양교육관', 'w', '교양관', '대전광역시 유성구 대학로 99', '042-821-7338'),
('469077473', '평생교육원', 'w', '평생교육원', '대전광역시 유성구 대학로 99', '042-821-5277'),
('469078036', '사회과학대학 강의동', 'w', '사회과학대학', '대전광역시 유성구 대학로 99', '042-821-6214'),
('469078473', '사회과학대학', 'w', '사회과학대학', '대전광역시 유성구 대학로 99', '042-821-6214'),
('469912983', '산학연교육연구관 별관', 'w', '산학연구관', '대전광역시 유성구 대학로 99', NULL),
('471329304', 'N14 생활과학대학', 'w', '생활과학대학', '대전광역시 유성구 대학로 99', '042-821-6814'),
('471329305', 'N11 생명시스템과학대학', 'w', '생명시스템과학대학', '대전광역시 유성구 대학로 99', '042-821-5572'),
('471329903', '충남대 언어교육원', 'w', '언어교육원', '대전광역시 유성구 대학로 99', NULL),
('471329904', '충남대학교 학생생활관 1동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329905', '청룡관 (N5-2)', 'w', '기타', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329906', '충남대학교 학생생활관 2동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329907', '충남대학교 학생생활관 3동 (N5-1)', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329908', '충남대학교 학생생활관 5동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329909', '충남대학교 학생생활관 4동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),('471329910', '충남대학교 학생생활관 6동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329911', '충남대학교 학생생활관 8동', 'w', '학생생활관', '대전광역시 유성구 대학로 99', '042-821-6181'),
('471329912', '충남대학교 학군단 (N3)', 'w', '학군단', '대전광역시 유성구 대학로 99', '042-821-6102'),
('471329913', '충남대학교 본부', 'w', '본부', '대전광역시 유성구 대학로 99', '042-821-5114'),
('480654896', '자연사박물관', 'w', '박물관', '대전광역시 유성구 대학로 99', '042-821-5292');

UPDATE Building 
SET tags = '{편의점, 식당}' 
WHERE name IN (
    '충남대학교 제3학생회관 (N7)'
);

UPDATE Building 
SET tags = '{편의점, 카페, 식당}' 
WHERE name IN (
    '상록회관',
    '제2학생회관',
    '제1학생회관'
);

UPDATE Building 
SET tags = '{편의점, 카페}' 
WHERE name IN (
    '충남대학교 중앙도서관 (N1)'
);

UPDATE Building
SET tags = 
    CASE
        WHEN tags IS NULL THEN '{승강기}'
        WHEN tags NOT LIKE '%승강기%' THEN CONCAT(tags, ', 승강기')
        ELSE tags
    END
WHERE name NOT IN (
    '충남대학교 제3학생회관 (N7)',
    '상록회관',
    '제2학생회관',
    '제1학생회관',
    '충남대학교 중앙도서관 (N1)'
);

-- 공과대학 5호관
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '공과대학 5호관'), 12455433255, 1, '부출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '공과대학 5호관'), 12455433253, 1, '후문 쪽'),
((SELECT building_id FROM Building WHERE name = '공과대학 5호관'), 12455433254, 1, '비상구 쪽');

-- 백마교양관
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '백마교양교육관'), 12455425570, 1, '하부 공동출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '백마교양교육관'), 12455425571, 1, '하부 부출입구 쪽 (1)'),
((SELECT building_id FROM Building WHERE name = '백마교양교육관'), 12455425572, 1, '하부 부출입구 쪽 (2)');

-- 충남대학교 제3학생회관 (N7)
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '충남대학교 제3학생회관 (N7)'), 12455430471, 1, '중앙 출입구 쪽');

-- 제1학생회관
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '제1학생회관'), 12455440164, 1, '부출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '제1학생회관'), 12455440165, 1, '식당 출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '제1학생회관'), 12072814039, 1, '주출입구 쪽');

-- 제2학생회관
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '제2학생회관'), 12455447051, 1, '좌측 출입구 쪽');

-- 충남대학교 중앙도서관 (N1)
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '충남대학교 중앙도서관 (N1)'), 12455447060, 1, '정문 쪽');

-- 공과대학 1호관
INSERT INTO Ramp (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '공과대학 1호관'), 12455440041, 1, '절벽에서 내려오는 계단 쪽 (1)'),
((SELECT building_id FROM Building WHERE name = '공과대학 1호관'), 1097717909, 1, '절벽에서 내려오는 계단 쪽 (2)'),
((SELECT building_id FROM Building WHERE name = '공과대학 1호관'), 1097718079, 1, '중앙 현관 쪽');

-- Insert data into Disabled_Restroom table using dynamic building_id selection
INSERT INTO Disabled_Restroom (building_id, node_id, floor, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '공과대학 5호관'), 12455490137, 1, '1층 후출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '충남대학교 중앙도서관 (N1)'), 12475068777, 2, '2층 자율 스터디룸 쪽'),
((SELECT building_id FROM Building WHERE name = '제1학생회관'), 12475077423, 1, '1층 부출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '제2학생회관'), 12475077424, 1, '1층 좌측 출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '백마교양교육관'), 12475077521, 1, '1층 중앙 쪽'),
((SELECT building_id FROM Building WHERE name = '백마교양교육관'), 12475077521, 1, '1층 중앙 쪽');

-- Insert data into Elevator table using dynamic building_id selection
INSERT INTO Elevator (building_id, node_id, location_description)
VALUES
((SELECT building_id FROM Building WHERE name = '제2학생회관'), 12475077425, '좌측 출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '백마교양교육관'), 12475077520, '중앙 쪽'),
((SELECT building_id FROM Building WHERE name = '공과대학 5호관'), 12474960951, '중앙 쪽'),
((SELECT building_id FROM Building WHERE name = '공과대학 3호관'), 12475059332, '주출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '제1학생회관'), 12475068469, '주출입구 쪽'),
((SELECT building_id FROM Building WHERE name = '충남대학교 중앙도서관 (N1)'), 12475068776, '중앙 계단 쪽');


INSERT INTO DisabilitySupportCenter (name, position, phone_number, building_id)
VALUES
('송혜진', '장애학생지원센터 규정 및 지원 담당자', '042-821-5057', (SELECT building_id FROM Building WHERE name = '한누리회관')),
('정민규', '사회적 장애 인식 및 진로 취업지원 담당자', '042-821-5069', (SELECT building_id FROM Building WHERE name = '한누리회관')),
('임은주', '동반자 지원사업 및 행정 담당자', '042-821-5058', (SELECT building_id FROM Building WHERE name = '한누리회관'));
